{
  "backend/main.mo": "Main ICP actor defining user profile and inquiry data models with CRUD operations, enforcing role-based access control via AccessControl and MixinAuthorization mixins.",
  "feature_evidence.json": "Feature evidence report confirming that the EnrollmentSection component displays the athletes@velocityhealthclinic.com email address prominently on the inquiry form.",
  "frontend-file-summaries.txt": "JSON map of all frontend source files to short summaries, serving as a quick reference for each component and hook in the project.",
  "frontend/index.css": "Base Tailwind CSS entry point defining OKLCH CSS custom properties for light and dark theme color tokens used throughout the app.",
  "frontend/index.html": "Minimal HTML shell with a root div and module script entry point for the Velocity Prime React application.",
  "frontend/src/App.tsx": "Root React component that composes all page sections (Navigation, Hero through Footer) in order for the single-page Velocity Prime marketing site.",
  "frontend/src/components/DiagnosticsSection.tsx": "Renders a grid of eight diagnostic test cards with badge labels and descriptions, plus a feature image and highlighted CCTA cardiac readiness entry.",
  "frontend/src/components/EnrollmentSection.tsx": "Enrollment inquiry form with validation, wearable device select, and backend submission via useSubmitInquiry; includes a success state and a mailto callout for athletes@velocityhealthclinic.com.",
  "frontend/src/components/FAQSection.tsx": "Renders eight FAQ entries as a collapsible shadcn/ui Accordion with questions and answers about the Velocity Prime program.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with the Velocity Prime logo, smooth-scroll nav links, copyright year, and a caffeine.ai attribution link.",
  "frontend/src/components/HeroSection.tsx": "Full-screen hero section with a background image, brand headline, tagline, CTA buttons to scroll to apply/program sections, and a stats strip showing key program numbers.",
  "frontend/src/components/MonitoringSection.tsx": "Displays an 8-card grid of monitored health areas (sleep, nutrients, hormones, etc.) with icons and descriptions, under a 'What We're Watching For' heading.",
  "frontend/src/components/Navigation.tsx": "Fixed top navigation bar with scroll-aware background, smooth-scroll desktop nav links, an Apply CTA button, and a collapsible mobile hamburger menu.",
  "frontend/src/components/PricingSection.tsx": "Pricing section displaying a single $12,000 6-month program card with a full inclusions checklist, pharmacy cost disclaimer, and an Apply CTA button.",
  "frontend/src/components/ProblemSection.tsx": "Section outlining six common athlete health problems (overtraining, deficiencies, poor sleep, etc.) in a card grid, followed by a callout positioning Velocity Prime as the solution.",
  "frontend/src/components/TimelineSection.tsx": "Renders a 6-month program timeline section with 5 alternating left/right steps displayed over a dark overlay background image.",
  "frontend/src/components/ValuePropositionSection.tsx": "Displays a three-pillar value proposition section (Baseline, Monitoring, Intervention) with icons and descriptions on a dark background.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login/logout flow, and identity persistence across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Exports a `useSubmitInquiry` mutation hook that submits a contact/inquiry form via the ICP backend actor.",
  "frontend/src/index.css": "Global CSS file that imports Barlow fonts, configures Tailwind, and defines dark-first OKLCH CSS custom properties for the design system along with utility classes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with React Query and Internet Identity providers.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the Velocity Prime frontend, extending the default theme with custom brand colors (oklch-based VP tokens, amber glow shadows), Barlow fonts, border radii, keyframe animations, and plugins for typography, container queries, and animate.",
  "project_state.json": "Tracks the overall Velocity Prime project state including version, architectural notes, known issues, and a detailed registry of existing and planned features with their requirement IDs and implementation versions."
}